
[
  {
  "dateTime": "2016-03-01T20:00:00",
  "artist": "Hippie Sabotage",
  "venue": "Showbox Market",
  "address": "1426 1st Ave Seattle, WA 98101",
  "coordinates": "47.6085082,-122.3416781",
  "venueUrl": "www.showboxpresents.com",
  "details": "All Ages to Enter, 21 & Over to Drink"
  },
  {
  "dateTime": "2016-03-02T19:00:00",
  "artist": "Galantis/USC",
  "venue": "Showbox Sodo",
  "address": "1700 1st Ave S Seattle, WA 98134",
  "coordinates": "47.587935,-122.3358859",
  "venueUrl": "www.showboxpresents.com",
  "details": "<p>[SOLD OUT] 18+ <a href='www.facebook.com/events/202549353411389/'>Facebook Event Page</a></p> <p>Widely known as the Swedish super-duo of the decade, the fiery feline group Galantis has been taking clubs and festivals by storm. Representing a vibe that can be described as “the place that EDM and pop meet” has landed them top spots on Electronic hit lists over the past few years. Don’t miss Galantis taking over the Showbox SoDo March 2nd!</p>"
  },
  {
  "dateTime": "2016-03-02T22:00:00",
  "artist": "Gladiator/SUBstance: Louder Harder Better Tour",
  "venue": "Foundation Nightclub",
  "address": "2218 Western Ave #100 Seattle, WA 98121",
  "coordinates": "47.6123987,-122.3486207",
  "venueUrl": "www.foundation-nightclub.com",
  "details": "<p>21+ Free admission with student ID</p> <p>SUBstance Wednesdays drink specials: 10-11pm All wells $3 11-12pm All wells $5 $3 Rolling Rock Tall Boys before 11pm</p> <p>Constantly evolving, spawning new sub-genres, and reaching into uncharted depths of the frequency range; bass music has been ingrained in the Seattle scene for well over two decades. Join us every Wednesday as we fuse the sounds of Dubstep, Drum and Bass, Trap, Moombahton, Glitch Hop, Drumstep, and everything in between to write the next chapter in this region’s bass music saga. No frills, no fluff, just industry champions and dedicated locals pushing our sound system to its limits every week. This is SUBstance.</p> <p>About Gladiator: <a href='www.gladiator-music.com'></a> <a href='soundcloud.com/gladiator'></a></p> <p>Born out of a passion for DJing, Gladiator was conceived in 2010 by Los Angeles natives Daniel Goodman and Ian Johnson. The duo is known for bringing an irresistible sense of fun and passion to every show with their unique genre-bending sets. After debuting with a series of self-released internet uploads and bootleg remixes, Gladiator joined the A-Trak led label Fool’s Gold and released their first official EP Assembly Line in 2014. Following this release they found the opportunity to make official remixes for the likes of Low Pros & Juvenile’s “Muscle,” Skrillex’s “Dirty Vibe” and Melanie Martinez’s “Soap,” as well as singles such as “Cruise Control” and “Cute” with fellow Fool’s Gold artists Sleepy Tom and Kittens.</p>"
  },
  {
  "dateTime": "2016-03-04T20:00:00",
  "artist": "Animal Collective",
  "venue": "Neptune Theatres",
  "address": "1303 NE 45th St Seattle, WA 98105",
  "coordinates": "47.6611709,-122.31621",
  "venueUrl": "www.stgpresents.org",
  "details": "<p>Animal Collective is pleased to announce an extensive worldwide tour in 2016, in support of their recently announced new album, Painting With, out February 19th on Domino. Starting in Philadelphia on album release day, the dates across North America and Europe will be the first live Animal Collective shows since 2013.</p> <p>Animal Collective is an American experimental pop group formed in Baltimore, Maryland in 1999. They were founded by Avey Tare (David Portner), Panda Bear (Noah Lennox), Deakin (Josh Dibb), and Geologist (Brian Weitz). Records released under the name Animal Collective may include contributions from any or all of these members; the lineup is not uniform, though Portner and Lennox have been on every Animal Collective release.</p> <p>The band’s music is characterized by studio experimentation, vocal harmonies, and an exploration of various genres which include freak folk, noise rock, ambient drone, and psychedelia. The group also runs the record label Paw Tracks on which they have released their own material as well as that of other artists. In 2009, the band released their most commercially successful album, Merriweather Post Pavilion, which Uncut magazine called: “one of the landmark American albums of the century so far”.</p><p>With special guest Ratking</p><p>Doors at 8:00 pm, Show at 9:00 pm</p><p>All Ages / Bar with ID</p><p><a href='www.facebook.com/events/413598415505048/'>Facebook Event Page</a></p>"
  },
  {
  "dateTime": "2016-03-05T20:00:00",
  "artist": "GoldLink & Sango",
  "venue": "Neumos",
  "address": "925 E. Pike St., Seattle, WA 98122",
  "coordinates": "47.613843,-122.32191",
  "venueUrl": "www.neumos.com",
  "details": "<p>Where the intersections of the DMV collide, GoldLink is a direct product. The first time 21-year-old GoldLink picked up a mic was only three years ago in his hometown and he has no intentions of putting it down. The emcee is piloting the “Future Bounce” genre, accruing over one million plays on his Soundcloud and capturing the attention of an entire industry with this first project, The God Complex, which released in late spring of 2014.</p><p>GoldLink’s sound is densely weighted with shimmering polyrhythmic sounds, constructed with formidable producers like Kaytranada, Lakim and Louie Lastic. His sound milks nostalgic cuts of 90s hip-hop and R&B and the area’s natural go-go heritage with transcending circadian drops of EDM and Afro-Caribbean drum patterns. GoldLink’s raps are calculated, tackling them with a roller-coaster delivery, with a distinct voice and unmeasurable cadence.</p><p>With his unyielding charm, Goldlink tackles his own battles of social and cultural injustice, pursuing a relatable voice of romantic instability. Without relying on talent alone, GoldLink has studied rap’s hierarchy, building his biting flow that’s quicker than a salesman and fouler than a sailor. Citing Edgar Allan Poe, Grimes, and Pink Floyd as his main influences, GoldLink’s subject matter highlights dealing cocaine, gun-toting friends, an absent father, and the general hardship of growing up in the ghetto.</p><p>Sango is a Seattle-born, now Grand Rapids, Michigan based producer who is most known for his remixes of Aaliyah, Drake, Little Dragon, Nas, The Weeknd, and now his debut album ‘North’. He is currently signed to Los Angeles record label Soulection, and music collective AGO. At the young age of 12, Sango started producing music alongside his older brother and his friends. His work mainly focuses on hip-hop, and soul influenced beats that over the years have been able to come together as his own distinctive innovative sound.</p><p>Apart from producing, Sango is a graphic designer. He has designed all of his releases up to date, which has shown that he is more than just a producer, but an artist in his own right. He has been featured on numerous publications for his self-disclosing interviews and tracks, such as Jay-Z’s ‘Life + Times’, Fader, Drake’s OVO blog, XLR8R, Noisey, Fader, THUMP, and more.</p><p>8pm doors</p><p>All ages, bar with ID</p><p><a href='www.facebook.com/events/1654544741490053/'>Facebook Event Page</a></p>"
  },
  {
  "dateTime": "2016-03-09T20:00:00",
  "artist": "Minnesota/SUBstance",
  "venue": "Foundation Nightclub",
  "address": "2218 Western Ave #100 Seattle, WA 98121",
  "coordinates": "47.6123987,-122.3486207",
  "venueUrl": "www.foundation-nightclub.com",
  "details": "<p>Constantly evolving, spawning new sub-genres, and reaching into uncharted depths of the frequency range; bass music has been ingrained in the Seattle scene for well over two decades. Join us every Wednesday as we fuse the sounds of Dubstep, Drum and Bass, Trap, Moombahton, Glitch Hop, Drumstep, and everything in between to write the next chapter in this region’s bass music saga. No frills, no fluff, just industry champions and dedicated locals pushing our sound system to its limits every week. This is SUBstance.</p><p>About Minnesota: <a href='www.soundcloud.com/minnesota'Minnesota></a></p><p>Minnesota is one of the most innovative and proficient electronic producers to come out of the West Coast bass music movement. His sound breaks aways from the various subgenres of EDM but holds onto origins of dubstep and hip-hop, creating a truly authentic experience for his audience. Early on in his career Minnesota said, “My goal is to make bass heavy dubstep/glitch-hop music that’ll get you dancing, but it is not the same old three note transformer step… I try to focus more on the melodic side of dubstep, and hopefully, make quality songwriting a more relevant factor in the genre.” For the past four years Minnesota has followed through on his word and designed smooth, melodic, uplifting sounds, which fans have celebrated nationwide.</p><p>21+</p><p>10PM-2AM</p><p>Dress code relaxed</p><p>Local support: Partners in Grime (Pressha & Kat1lyst)</p><p>SUBstance Wednesdays drink specials:</p><p>$3 wells 10-11pm</p><p>$5 wells 11-12am</p><p>$3 Rolling Rock Tall Boys before 11pm</p>"
  },
  {
  "dateTime": "2016-03-10T22:00:00",
  "artist": "Tokimonsta",
  "venue": "Showbox",
  "address": "1700 1st Ave S Seattle, WA 98134",
  "coordinates": "47.587935,-122.3358859",
  "venueUrl": "www.showboxpresents.com",
  "details": "<p>Los Angeles native, TOKiMONSTA (Jennifer Lee) is known for her unique take on indie electronic/r&b/dance music. Her classical upbringing and eclectic music taste has allows her to create vast textural soundscapes—a reverberation that fuses vintage sensibilities with progressive inclinations.</p><p>Her music has been recognized and praised by the very best in tastemaker and mainstream media. TOKiMONSTA has been featured on various large-scale radio programs such as: BBC Radio1 (UK), NPR (USA), BBC World Service (UK), J Wave (JP), Studio Brussels (BE), Radio Nova (FR), KCRW (LA) to name a few. Subsequently, DJ Mag, Pitchfork, The Guardian, XLR8R, Paper, LA Times, Dazed and Confused, SPIN, Wax Poetics, MTV, VIBE, Billboard, Rolling Stone, Sound and Recording and more have covered her. LA Weekly ranked her as 2010’s #1 female DJ in Los Angeles. Additionally, Resident Adviser did a full feature on her for their “Breaking Through,” an RA series, which focuses on the next big artist.</p><p>Not only has she caught ears of many as a different dimension of Los Angeles-based music, TOKiMONSTA is notably the first female to join Flying Lotus’ crew/label BRAINFEEDER, which is on the forefront of LA music scene.</p>"
  },
  {
  "dateTime": "2016-03-11T22:00:00",
  "artist": "TJR",
  "venue": "Foundation Nightclub",
  "address": "2218 Western Ave #100 Seattle, WA 98121",
  "coordinates": "47.6123987,-122.3486207",
  "venueUrl": "www.foundation-nightclub.com",
  "details": "<p>Fuzzyheaded and disheveled, you wake up the next morning with confetti in your pockets and scattered down your hallway. Yep! It’s the mark of Resonate Fridays at Foundation Nightclub. It comes down to one thing: EDM is the ultimate party music. High-energy beats combine with funk-fueled basslines to create the perfect soundtrack for an unforgettable night out. Join us each week for Resonate Fridays as we inject the newest Electro, Funky Breaks, Big Room House, and Bass Music to create an unrivaled party experience. Friday nights in Belltown are about to be turned up to 11, so prepare to walk away each week saying one thing: “Best. Night. Ever.”</p><p>TJR:</p><p><a href='www.iamtjr.com'>I am TJR</a></p><p><a href='soundcloud.com/tjr'>Soundcloud</a></p><p>TJR (real name TJ Rozdilsky) has built a formidable catalogue of original tracks and remixes since exploding on the scene in 2008. He’s the consummate DJ’s DJ and its clear that the mixing skills he’s honed over his career have never been more relevant; spinning, rolling and scratching live, TJR is a sight to behold behind the decks, especially in an era of pre-programmed playlists.</p>"
  },
  {
  "dateTime": "2016-03-16T22:00:00",
  "artist": "Spag Heddy/SUBstance",
  "venue": "Foundation Nightclub",
  "address": "2218 Western Ave #100 Seattle, WA 98121",
  "coordinates": "47.6123987,-122.3486207",
  "venueUrl": "www.foundation-nightclub.com",
  "details": "<p>Constantly evolving, spawning new sub-genres, and reaching into uncharted depths of the frequency range; bass music has been ingrained in the Seattle scene for well over two decades. Join us every Wednesday as we fuse the sounds of Dubstep, Drum and Bass, Trap, Moombahton, Glitch Hop, Drumstep, and everything in between to write the next chapter in this region’s bass music saga. No frills, no fluff, just industry champions and dedicated locals pushing our sound system to its limits every week. This is SUBstance.</p><p>About Spag Heddy:</p><p><a href=www.soundcloud.com/spagheddy>Soundcloud</a></p><p>Straight from the kitchens of Pastanistan, SPAG HEDDY delivers your daily need for filthy, wonky and juicy \tomato bass. Since 2011, Mischa Reining (NL) has been well known for his constant flow of both heavy and melodic tunes in the dubstep and drumstep genres. Major producers/dj’s like Skrillex, Datsik, Excision, Cookie Monsta, MUST DIE!, xKore, Megalodon and AFK have picked up the bolognese bass, while official releases and remixes on Firepower, NSD Black Label, Play Me, Monstercat and Disciple, have made sure you can’t ignore this Dutch producer anymore.</p><p>SPAG has a big dedicated fanbase, full support from mega promotion channels like EDM.com, DropTheBassline and DubstepGutter, and has his own official sample pack released through Prime Loops. Now, after two Top 3 Beatport hits, numerous shows in The Netherlands, Germany, France, Switzerland, Spain, and a USA tour, SPAG HEDDY is aiming for the biggest and best; expect tons of new ferocious and monstrous, squealing and neck-breaking anthems.</p>"
  },
  {
  "dateTime": "2016-03-18T20:00:00",
  "artist": "Dimond Saints (An-ten-nae + Releece) with Subaqueous",
  "venue": "Nectar Lounge",
  "address": "412 N 36th St, Seattle, WA 98103",
  "coordinates": "47.6529648,-122.3598398",
  "venueUrl": "www.nectarlounge.com",
  "details": "<p>Dimond Saints (an-ten-nae + Releece)</p><p>Oakland, CA</p><p><a href='www.dimondsaints.com'>Dimondsaints</a></p><p><a href='www.soundcloud.com/dimondsaints'>Soundcloud</a></p><p>Dimond Saints is an Oakland based duo, that has quickly emerged to push the boundaries of electronic music. Their signature sound drips of passion and deeply resonates with mind body and soul. Their live show is both explosive and soulful, creating a place where heavy bass and angelic melodies collide. The Dimond Saints are on the rise, as they continue on their mission of giving love to the world!</p><p>Subaqueous</p><p>Portland, OR</p><p>Isaac Cotec, aka Subaqueous, started making electronic based music in the summer of 2005 working with a project called Psyche Sonics. Psyche Sonics is an experimental group working with binaural beats and altering consciousness through sounds. The Project traveled in a large yurt that moved around the PNW on tour as a musical Art instillation. It was featured in such festivals as Beloved, Emerg+n+see, Oracle Gatherings, and others. After touring with his experimental and ambient based project Isaac Cotec continued to make music and grow as a musician. As of March 12th 2011 the unique character and sound of Subaqueous was born.</p>"
  }
];
